In [4]:
import pandas as pd 
import numpy as np

In [6]:
sports1=pd.Series([1,2,3,4],index=['Cricket','Football','Kabbadi','golf'])
sports1

Cricket     1
Football    2
Kabbadi     3
golf        4
dtype: int64

In [8]:
sports1['Kabbadi']

3

In [13]:
sports2=pd.Series([11,12,13,14],index=['Cricket','Football','Kabbadi','golf'])
sports2

Cricket     11
Football    12
Kabbadi     13
golf        14
dtype: int64

In [14]:
sports1+sports2

Cricket     12
Football    14
Kabbadi     16
golf        18
dtype: int64

In [17]:
df1=pd.DataFrame(np.random.rand(2,4),index='1 2 '.split(),columns='s1 s2 s3 s4'.split())
df1

         s1        s2        s3        s4
1  0.744930  0.206154  0.349087  0.582018
2  0.998549  0.725257  0.017713  0.329116

In [19]:
df1.drop('s1', axis=1)

         s2        s3        s4
1  0.206154  0.349087  0.582018
2  0.725257  0.017713  0.329116

In [21]:
df1['s3']=df1['s1']+df1['s2']
df1

         s1        s2        s3        s4
1  0.744930  0.206154  0.951084  0.582018
2  0.998549  0.725257  1.723806  0.329116

In [22]:
df1['s1']

1    0.744930
2    0.998549
Name: s1, dtype: float64

In [27]:
df1.drop('1')

         s1        s2        s3        s4
2  0.998549  0.725257  1.723806  0.329116

In [28]:
df2={'ID':[1001,1002,1003,1004],'Name':['Kavin','Carry','John','Lally'],'Profile':[1,2,3,4]}
df=pd.DataFrame(df2)
df

     ID   Name  Profile
0  1001  Kavin        1
1  1002  Carry        2
2  1003   John        3
3  1004  Lally        4

In [29]:
df.drop('ID',axis=1)

    Name  Profile
0  Kavin        1
1  Carry        2
2   John        3
3  Lally        4

In [30]:
df.drop(2)

     ID   Name  Profile
0  1001  Kavin        1
1  1002  Carry        2
3  1004  Lally        4

In [31]:
df[['ID','Name']]

     ID   Name
0  1001  Kavin
1  1002  Carry
2  1003   John
3  1004  Lally